Личный_помощник/src/Documents/ФиксацияПоказателейКоммунальныхУслуг/ФиксацияПоказателейКоммунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФиксацияПоказателейКоммунальныхУслуг</name>
  <registerRecords>InformationRegister.ПоказанияСчетчиков</registerRecords>
  <registerRecords>AccumulationRegister.ФиксацияПоказателейКоммунальныхУслуг</registerRecords>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>МесяцОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.ВидыУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущееПоказаниеСчетчика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПотребляемоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипУчета</name>
      <type>
        <types>EnumRef.ТипУчетаУслуги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Личный_помощник/src/AccumulationRegisters/ФиксацияПоказателейКоммунальныхУслуг/ФиксацияПоказателейКоммунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ФиксацияПоказателейКоммунальныхУслуг</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидУслуг</name>
    <type>
      <types>CatalogRef.ВидыУслуг</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Личный_помощник/src/InformationRegisters/ПоказанияСчетчиков/ПоказанияСчетчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказанияСчетчиков</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидУслуги</name>
    <type>
      <types>CatalogRef.ВидыУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Личный_помощник/src/Documents/ФиксацияПоказателейКоммунальныхУслуг/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЭтотОбъект.Дата = ТекущаяДата();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		
		Если ТекСтрокаУслуги.Сумма <> 0 Тогда
			Движение = Движения.ФиксацияПоказателейКоммунальныхУслуг.Добавить();
			Движение.Период = Дата;
			Движение.ВидУслуг = ТекСтрокаУслуги.Услуга;
			Движение.Количество = ТекСтрокаУслуги.ПотребляемоеЗначение;
			Движение.Сумма = ТекСтрокаУслуги.Сумма;			
		КонецЕсли;
		
		Если ТекСтрокаУслуги.ТекущееПоказаниеСчетчика <> 0 Тогда
			Движение = Движения.ПоказанияСчетчиков.Добавить();
			Движение.Период = Дата;
			Движение.ВидУслуги = ТекСтрокаУслуги.Услуга;
			Движение.Значение = ТекСтрокаУслуги.ТекущееПоказаниеСчетчика;	
		КонецЕсли;
	
	КонецЦикла;
	
	Движения.ФиксацияПоказателейКоммунальныхУслуг.Записывать = Истина;
	Движения.ПоказанияСчетчиков.Записывать = Истина;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		// Очистим движения
		Если Не ЭтотОбъект.ЭтоНовый() Тогда
			// Надо очистить все регистры.
			Движения.ФиксацияПоказателейКоммунальныхУслуг.Записывать = Истина;
			#Если МобильноеПриложениеСервер Тогда
				// Обход ошибки моб. платформы 10143497
				Движения.ФиксацияПоказателейКоммунальныхУслуг.Очистить();
				// Конец  Обход ошибки моб. платформы 10143497
			#КонецЕсли 
			Движения.Записать();
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
